In [1]:
import pandas as pd
import gmaps



from config import gkey

gmaps.configure(api_key=gkey)

In [2]:
country_df = pd.read_csv('country capitals coordinates.csv')
country_df.head()

,CountryName,CapitalName,CapitalLatitude,CapitalLongitude,CountryCode,ContinentName,Unnamed: 6
0,Somaliland,Hargeisa,9.55,44.050000,NaN,Africa,NaN
1,South Georgia and South Sandwich Islands,King Edward Point,-54.283333,-36.500000,GS,Antarctica,NaN
2,French Southern and Antarctic Lands,Port-aux-Français,-49.35,70.216667,TF,Antarctica,NaN
3,Palestine,Jerusalem,31.76666667,35.233333,PS,Asia,NaN
4,Aland Islands,Mariehamn,60.116667,19.900000,AX,Europe,NaN

In [38]:
capitals_df = capitals.dropna(how='any')

In [5]:
fertility_rates_df = pd.read_csv('csv_files/Age-specific fertility rates, Total fertility and .csv')

fertility_rates_df.head

<bound method NDFrame.head of      United Nations, Department of Economic and Social Affairs Unnamed: 1  \
0     Population Division, Fertility and Family Plan...               NaN
1     World Fertility Data 2012\r\nAGE-SPECIFIC FERT...               NaN
2                                               Country          ISO code
3                                                   NaN               NaN
4                                           Afghanistan                 4
...                                                 ...               ...
1072                                           Zimbabwe               716
1073                                           Zimbabwe               716
1074                                           Zimbabwe               716
1075                                           Zimbabwe               716
1076                                           Zimbabwe               716

       Unnamed: 2  Unnamed: 3 Unnamed: 4       Unnamed: 5  \
0             NaN         NaN        NaN              NaN
1             NaN         NaN        NaN              NaN
2          Period  Reference         NaN  Total fertility
3             NaN        Year     Period              NaN
4     Around 1970        1973  1972-1973             8.21
...           ...         ...        ...              ...
1072  Around 1970        1969  1968-1969             6.74
1073  Around 1985        1987  1985-1988             5.42
1074  Around 1995        1998  1996-1999             3.98
1075  Around 2005        2004  2002-2005              3.8
1076       Latest        2009  2008-2011             4.11

                        Unnamed: 6 Unnamed: 7 Unnamed: 8 Unnamed: 9  ...  \
0                              NaN        NaN        NaN        NaN  ...
1                              NaN        NaN        NaN        NaN  ...
2     Age-specific fertility rates        NaN        NaN        NaN  ...
3                            15-19      20-24      25-29      30-34  ...
4                              168        359        355        307  ...
...                            ...        ...        ...        ...  ...
1072                            79        272        304        257  ...
1073                           102        251        250        212  ...
1074                           112        199        180        135  ...
1075                            99        205        172        144  ...
1076                           115        212        194        149  ...

     Unnamed: 11 Unnamed: 12                Unnamed: 13  Unnamed: 14  \
0            NaN         NaN                        NaN          NaN
1            NaN         NaN                        NaN          NaN
2            NaN         NaN  Mean age at childbearing   Source type
3          40-44       45-49                        NaN          NaN
4            137          81                         30       Survey
...          ...         ...                        ...          ...
1072         145          73                       31.2       Census
1073          80          32                       29.5       Survey
1074          46          15                       28.3       Survey
1075          42          13                       28.1       Survey
1076          35          12                       27.9       Survey

              Unnamed: 15                                        Unnamed: 16  \
0                     NaN                                                NaN
1                     NaN                                                NaN
2                  Source                                        Survey name
3                     NaN                                                NaN
4     National statistics  Afghanistan 1972-1974 National Demographic and...
...                   ...                                                ...
1072  National statistics                                                NaN
1073                  DHS        Zimbabwe 1988 Demographic and Health Survey
1074                  DHS        Zimbabwe 1999 Demographic and Health Survey
1075                  DHS   Zimbabwe 2005-2006 Demographic and Health Survey
1076                  DHS   Zimbabwe 2010-2011 Demographic and Health Survey

                        Unnamed: 17  Unnamed: 18      Unnamed: 19  \
0                               NaN          NaN              NaN
1                               NaN          NaN              NaN
2     Note on country or population  Note on age  Note on methods
3                               NaN          NaN              NaN
4                               NaN          NaN              NaN
...                             ...          ...              ...
1072                            NaN          NaN              NaN
1073                            NaN          NaN              NaN
1074                            NaN          NaN              NaN
1075                            NaN          NaN              NaN
1076                            NaN          NaN              NaN

                                      Unnamed: 20
0                                             NaN
1                                             NaN
2     Note on population data used in denominator
3                                             NaN
4                                             NaN
...                                           ...
1072                                          NaN
1073                                          NaN
1074                                          NaN
1075                                          NaN
1076                                          NaN

[1077 rows x 21 columns]>

In [6]:
total_fertility_df = fertility_rates_df.loc[:, ["United Nations, Department of Economic and Social Affairs", "Unnamed: 5"]]
total_fertility_df.head()

  United Nations, Department of Economic and Social Affairs       Unnamed: 5
0  Population Division, Fertility and Family Plan...                     NaN
1  World Fertility Data 2012\r\nAGE-SPECIFIC FERT...                     NaN
2                                            Country         Total fertility
3                                                NaN                     NaN
4                                        Afghanistan                    8.21

In [7]:
total_fertility_clean = total_fertility_df.loc[4:1074, "United Nations, Department of Economic and Social Affairs":"Unnamed: 5"]
total_fertility_clean.head(10)

   United Nations, Department of Economic and Social Affairs Unnamed: 5
4                                         Afghanistan              8.21
5                                         Afghanistan              7.11
6                                         Afghanistan              7.52
7                                         Afghanistan              5.11
8                                             Albania              5.16
9                                             Albania              3.33
10                                            Albania              2.86
11                                            Albania              1.61
12                                            Albania              1.33
13                                            Algeria              7.86

In [8]:
total_fertility_renamed = total_fertility_clean.rename(columns={"United Nations, Department of Economic and Social Affairs": "country", "Unnamed: 5": "fertility"})
total_fertility_renamed.head(20)

           country fertility
4      Afghanistan      8.21
5      Afghanistan      7.11
6      Afghanistan      7.52
7      Afghanistan      5.11
8          Albania      5.16
9          Albania      3.33
10         Albania      2.86
11         Albania      1.61
12         Albania      1.33
13         Algeria      7.86
14         Algeria      5.35
15         Algeria      4.38
16         Algeria      2.38
17         Algeria      2.74
18  American Samoa      5.83
19  American Samoa      4.18
20  American Samoa      3.97
21  American Samoa       4.1
22  American Samoa      3.38
23         Andorra      1.08

In [16]:
clean_total_fertility = total_fertility_renamed.loc[total_fertility_renamed['fertility'] != '..']
clean_total_fertility.head()

       country fertility
4  Afghanistan      8.21
5  Afghanistan      7.11
6  Afghanistan      7.52
7  Afghanistan      5.11
8      Albania      5.16

In [23]:
clean_total_fertility["fertility"] = clean_total_fertility["fertility"].astype('float')
clean_total_fertility.head()

C:\Users\mzzjo\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

       country  fertility
4  Afghanistan       8.21
5  Afghanistan       7.11
6  Afghanistan       7.52
7  Afghanistan       5.11
8      Albania       5.16

In [24]:
total_fertility_groups = clean_total_fertility.groupby(["country"])
total_fertility_groups

In [34]:
unique_countries_fertility = total_fertility_groups["fertility"].mean()
unique_countries_fertility = unique_countries_fertility.reset_index()
unique_countries_fertility

                       country  fertility
0                  Afghanistan     6.9875
1                      Albania     2.8580
2                      Algeria     4.5420
3               American Samoa     4.2920
4                      Andorra     1.2000
..                         ...        ...
218                   Viet Nam     3.4240
219  Wallis and Futuna Islands     3.9500
220                      Yemen     6.7980
221                     Zambia     6.2440
222                   Zimbabwe     5.3800

[223 rows x 2 columns]

In [40]:
combined_data_df = unique_countries_fertility.merge(country_df, left_on="country", right_on="CountryName")
combined_data_df.head()

,country,fertility,CountryName,CapitalName,CapitalLatitude,CapitalLongitude,CountryCode,ContinentName,Unnamed: 6
0,Afghanistan,6.9875,Afghanistan,Kabul,34.51666667,69.183333,AF,Asia,NaN
1,Albania,2.8580,Albania,Tirana,41.31666667,19.816667,AL,Europe,NaN
2,Algeria,4.5420,Algeria,Algiers,36.75,3.050000,DZ,Africa,NaN
3,American Samoa,4.2920,American Samoa,Pago Pago,-14.26666667,-170.700000,AS,Australia,NaN
4,Andorra,1.2000,Andorra,Andorra la Vella,42.5,1.516667,AD,Europe,NaN

In [46]:
fertility = combined_data_df["fertility"]

In [47]:
combined_data_df["CapitalLatitude"] = combined_data_df["CapitalLatitude"].astype('float')
combined_data_df["CapitalLongitude"] = combined_data_df["CapitalLongitude"].astype('float')

In [48]:
capitals = combined_data_df[["CapitalLatitude", "CapitalLongitude"]]

In [63]:
fig = gmaps.figure()


heat_layer = gmaps.heatmap_layer(capitals, weights=fertility*15,
                                 dissipating=False, 
                                max_intensity=50,
                                 point_radius=2)



fig.add_layer(heat_layer)

fig

Figure(layout=FigureLayout(height='420px'))